backend/app/controllers/contacts_controller.rb

SELECT "contacts".* FROM "contacts"
---
  def index
    contacts = Contact.all

INSERT INTO "contacts" ("first_name", "last_name", "phone", "email", "address", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    contact = Contact.new(
      first_name: params[:first_name],
      last_name: params[:last_name],
      phone: params[:phone],
      email: params[:email],
      address: params[:address],
      user_id: params[:user_id]
    )
    if contact.save

SELECT "contacts".* FROM "contacts" WHERE "contacts"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]
SELECT "contacts".* FROM "contacts" WHERE "contacts"."id" = ? LIMIT ?  [["id", 16], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 12], ["LIMIT", 1]]
UPDATE "contacts" SET "address" = ?, "updated_at" = ? WHERE "contacts"."id" = ?  [["address", "Irvine, CA"], ["updated_at", "2021-10-24 05:59:25.878972"], ["id", 8]]
---
  def update
    # byebug
    contact = Contact.find_by(id: params[:id])
    user = contact.user
    contact.first_name = params[:first_name]
    contact.last_name = params[:last_name]
    contact.phone = params[:phone]
    contact.email = params[:email]
    contact.address = params[:address]

    if contact.save

SELECT "contacts".* FROM "contacts" WHERE "contacts"."id" = ? LIMIT ?  [["id", 16], ["LIMIT", 1]]
DELETE FROM "contacts" WHERE "contacts"."id" = ?  [["id", 16]]
---
  def destroy
    contact = Contact.find_by(id: params[:id])
    user = contact.user
    contact.destroy