backend/app/controllers/notes_controller.rb

  def create
    note = Note.new(
      text: params[:text],
      contact_id: params[:contact_id]
    )
    if note.save
---
INSERT INTO "notes" ("text", "contact_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["text", "Test"], ["contact_id", 1], ["created_at", "2021-10-23 22:40:55.754321"], ["updated_at", "2021-10-23 22:40:55.754321"]]

  def destroy
    note = Note.find_by(id: params[:id])
    user = note.contact.user
    note.destroy
---
SELECT "notes".* FROM "notes" WHERE "notes"."id" = ? LIMIT ?  [["id", 10], ["LIMIT", 1]]
DELETE FROM "notes" WHERE "notes"."id" = ?  [["id", 10]]