backend/app/controllers/users_controller.rb

  def login
    user = User.find_by(username: params[:username])
---
SELECT "users".* FROM "users" WHERE "users"."username" = ? LIMIT ?  [["username", "Joe"], ["LIMIT", 1]]

  def create
    user = User.new(username: params[:username], password: params[:password])
    if user.save
---
INSERT INTO "users" ("username", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["username", "g"], ["password_digest", "$2a$12$/HDK2926vabLu21qHOBZ0.MBlitCuxTFAvzftzc0CG0Oh4LBKmcCK"], ["created_at", "2021-10-23 01:38:19.320137"], ["updated_at", "2021-10-23 01:38:19.320137"]]